{"blog/A-Psalm-for-the-Wild-Built":{"slug":"blog/A-Psalm-for-the-Wild-Built","filePath":"blog/A Psalm for the Wild-Built.md","title":"A Psalm for the Wild-Built","links":[],"tags":["book-review"],"content":"Becky Chambers, 2021, a Science Fiction/Solarpunk Novella\nThe story is set in a post-AI utopia, where the robots, upon gaining consciousness, fled into the wild, and humanity rebuilt its society with a reverence to nature, including technology. The society is built where machines can only be tools for humans, but cannot replace tasks. There is a kind of natural objectivism that is explored, represented through the religion that is constructed—agreed to exist by the robot that is encountered. Harmony with the forces of nature, including consciousness, is prioritized above all, and the society is made around that, which brings them to the utopia.\nKey to the world is that all characters are completely unalienated from their work. No one works for others; the professions are all traders, tea makers, monks, teachers, doctors, artists, farmers, etc. Everyone is completely connected to the products of their labor, and everyone has complete autonomy over what they do or make. There is a social aspect to all the work that is done. Even for the robots, they all have key specializations from which they derive meaning, even if it is only to observe the world. A very “from each according to ability, to each according to their need” vibe is present: “They work the farmland in Haydale, and it produces a lot of food. We had a surplus. A surplus has to be shared.”\nThe story explored is that of someone trying to find fulfilment in this world. Really just some core struggles that come up when trying to get to the top of Maslow’s hierarchy. Finding purpose is hard, even when you’re good at things and make the world better or make those around you happier. The robot’s existence, and what it blatantly states at the end, is that ultimately fulfillment can only be found through the abandonment of purpose as an end-goal at all, and to simply exist as a creature in nature. The book proposes that this is an idea to consider once all our needs are met.\nThe book reveres nature; it spends a lot of time describing the beauty of different scenes. As part of that, it explores the contradictions in nature stemming from the conflict of existence—needing organisms to die to sustain others, and the general cycle of life. Respecting this is, in some sense, “good,” as the robots with their supreme intellect choose to recycle parts into new individuals rather than repairing old ones and submit themselves to death, as they want to be in accordance with nature. The fact that humans, even in their utopia, divide the land between human settlements and wilds—comprising half the land area and avoided by humans—is seen as a blindness to the fact that humans are just animals like all others. It proposes Winn’s paradox: “the ecosystem as a whole needs its participants to act with restraint in order to avoid collapse, but the participants themselves have no inbuilt mechanism to encourage such behavior […] other than fear, which is a feeling you want to avoid or stop at all costs.” Underlying this is the idea that the harmony that has been achieved in the society, however imperfect, was attained through the process of creating and losing the robots who chose to leave—a key historical event in this world. The existence, and vague moral or real fear underlying the consciousness in the robots, has somehow kept the humans in check.\nI like the general approach of the book to describe the kind of internal conflicts people might face as a way of normalizing the anarchist utopia that this world envisions, with the backdrop of meaningful autonomous work, an inclusive society, and helping others. The normalization is a very powerful technique: a cozy, adorable story is created to ease you into these broader political/philosophical ideas, it’s very neat. I dislike that being in accordance with nature is presented as the prime directive to reach this utopia, as opposed to the well-being of people as the ultimate goal in and of itself—likely why I’m sure killing and eating animals is seen as morally fine in this world, as a naturalistic fallacy. As a small nitpick, the fact that money (“pebs”) exists in this utopian society is unimaginative and kind of contradictory to the whole vibe of everyone just doing things to help each other and existing well. People get things for free all the time in this world. It’s only mentioned twice in passing and could have easily been left out.\nI think the question of whether we need technology to reach utopia is left up to debate in this framework—we don’t need it in practice, but we might need its threat in order for us to engage with our animal instincts and live in accordance with nature.\n3⁄5","date":"2024-11-13T00:00:00.000Z"},"blog/Cooking-Techniques":{"slug":"blog/Cooking-Techniques","filePath":"blog/Cooking Techniques.md","title":"Cooking Techniques","links":[],"tags":["recipes"],"content":"Cooking onions quickly (the baking powder trick)\nSauteing mushrooms efficiently\nCooking beans well (the teabag trick)\nCauliflower cooking effects\nEmulsifying soup with bread\nUse the long thing eggplants in most applications! Big ones just for baba ganoush.","date":"2019-12-15T00:00:00.000Z"},"blog/Maths-and-the-Logistics-of-Vehicle-Routing":{"slug":"blog/Maths-and-the-Logistics-of-Vehicle-Routing","filePath":"blog/Maths and the Logistics of Vehicle Routing.md","title":"Maths and the Logistics of Vehicle Routing","links":[],"tags":["math"],"content":"Here’s an example problem I was working on with some colleagues. Let’s consider a pretty specific setup for a logistical vehicle routing problem. Say we have a bunch of factories located around a city, and each has finished working on some components that we want to bring together at a main warehouse. We want to find the most efficient way to get those components to the warehouse but to complicate things we also have a limited fleet of trucks that are spread out around the factories. We have fewer trucks than we have factories, so some factories will have to rely on their components being picked up by trucks coming from others. For this problem we’ll look at the case that each factory only has one or two components, each of fairly uniform size; but this is all fairly easily generalisable to when this isn’t the case. Also, we only consider the case where the truck fleet has enough capacity to carry all of the components without requiring multiple trips.\nFull Mathematical Model\nThe first thing we’ll do is try to fully describe this problem in mathematical terms. Applied mathematics is really about trying to capture and model the real world so we can use the powerful techniques developed in pure mathematics. Experienced users of applied mathematics will be jumping to model this with integer linear programming. This means it’s an optimisation problem with integers involved where the constraints defining the problem are linear expressions; while that might not seem intuitive immediately we’ll be able to see why that is soon.\nDefining the resources\nThe first step is to define what we know about our setup. Let’s say T is our set of m trucks, F is our set of n factories, w is the warehouse. For convenience, we define the locations L = F\\cup w, the set of factories and the warehouse. We also know the cost of travelling between two places c. The cost can be the distance between two places, the time taken to travel, the monetary cost associated with that leg, or any other cost we want to define. For instance, c\\_{f,w} is the cost of a truck going from factory f straight to the warehouse. We know the number of components at a factory f, which we’ll call p\\_f. We have the number of components that truck t can carry, which we’ll call q\\_t. We also know which factories our trucks start at, which we’ll encode in \\lambda. If truck t starts at factory f, we write \\lambda\\_t=f.\nDecision variables\nOptimisation at its core is about decision making. So if we’re going to define a problem, we want to know exactly how to interpret an answer to make a decision. Really what we want to know is whether we use a certain truck (because the most efficient solution might be to ignore some of the trucks), and the route for each truck. Let’s define them.\n\na\\_t is 1 if truck t is used and 0 otherwise\nx\\_{t,i,j} is 1 if truck t travels from point i to point j, and 0 if not. The points to pick from will be the factories and the warehouse. By putting together all the segments that truck t travels along, we can construct its entire route.\n\nWe also need to define some extra variables to keep track of how full the trucks are. While this isn’t really a decision to be made, it’ll come in handy later.\n\nu\\_{t,i,j} is equal to the number of components that truck t transports from point i to point j.\n\nObjective function\nThis is an optimisation problem, so we need to define what we’re actually going to optimise for. While there are a number of candidates, the simplest (and usually most useful) option is just to say that we want to minimise the total amount of travelling that’s done across all the trucks. That way the best solution won’t use trucks that we won’t need, and we don’t have trucks driving to opposite ends of the city if we don’t need them to. Whether we want to define that travelling as distance travelled, time taken, or fuel used will be up to each project. We could go a step further here and include the cost of manpower and the trucks involved, but that’s simply incorporated into the model here on a project by project basis. Here’s how we write it in mathematical terms: \\min \\sum\\_{t\\in T}\\sum\\_{i,j\\in L}c\\_{i,j}x\\_{t,i,j}\nWe can read this as for each truck sum up the cost of each leg multiplied by whether the truck travelled that leg (0 or 1). Take the sum of these terms for each truck, then minimise the result. Optionally, we could also model the case where there is a fixed cost for using each truck. Let’s say if we use truck t, there is a fixed cost of b\\_t. In this case, we would want the leg costs a\\_t to be measured in the same units, so monetary costs would be best as opposed to distance or time. We would then alter the objective function to\n\\min \\sum\\_{t\\in T}\\sum\\_{i,j\\in L}c\\_{i,j}x\\_{t,i,j} + \\sum\\_{t\\in T}b\\_t a\\_t\nConstraints\nIn order to convert the real world problem into a mathematical format, it is extremely useful to think of the rules of the problem as geometric constraints to the objective function. In this problem, we will see that all the constraints are linear expressions, which is a highly desirable property of a problem as it makes them easily solvable. So let’s go step by step through the problem, describing what we want to achieve, a more explicit way of describing it, then the mathematical expression.\nFirstly, we define the domains of the variables that we defined before.\n\\begin{align}\n\na\\_t &amp;\\in \\text{{0,1}} &amp;&amp; \\forall t\\in T \\newline\n\nx\\_{t,i,j} &amp;\\in \\text{{0,1}} &amp;&amp; \\forall t\\in T,\\ \\forall i,j\\in L \\newline\n\nu\\_{t,i,j} &amp;\\in \\mathbb{N} &amp;&amp; \\forall t\\in T,\\ \\forall i,j\\in L\n\n\\end{align}\nWe want to ensure that all the components are picked up. The way we do this is by measuring the change in the number of components that trucks are carrying as they pass through the factories. For each factory, the total change of components across all the trucks must sum to the number of components at the factory.\n\\begin{equation}\n\n\\sum\\_{t\\in T}\\left(\\sum\\_{j\\in L}u\\_{t,f,j} - \\sum\\_{i\\in L}u\\_{t,i,f}\\right) = p\\_f,\\qquad \\forall f\\in F\n\n\\end{equation}\nNow we don’t allow a truck to travel from one location to the same location as one leg. That is, for each truck and location, the truck cannot travel from the location to the same location.\n\\begin{equation}\n\nx\\_{t,i,i} = 0,\\qquad \\forall t\\in T,\\ \\forall i\\in L\n\n\\end{equation}  \nThis next equation will include two pieces of information. A truck can’t transport any components down a leg if it cannot travel down that leg. When x\\_{t,i,j}=0, then u\\_{t,i,j}=0. Also, the most components that the truck can take down a leg is the capacity of the truck. When x\\_{t,i,j}=1, u\\_{t,i,j}\\le q\\_t. We combine these as\n\\begin{equation}\n\nu\\_{t,i,j} \\le q\\_tx\\_{t,i,j},\\qquad \\forall t\\in T,\\ \\forall i,j\\in L\n\n\\end{equation}\nWe’ll need a few equations to describe the paths that the trucks are allowed to travel down. We only want trucks to travel out of locations that they travelled into in the first place, so we don’t get trucks appearing or disappearing. For each truck, at each factory except its starting location, the number of times the truck enters the factory is equal to the number of times the truck leaves the factory.\n\\begin{equation}\n\n\\sum\\_{i\\in F}x\\_{t,i,f} = \\sum\\_{j\\in F}x\\_{t,f,j},\\qquad \\forall t\\in T,\\ \\forall f\\in F,\\ f\\ne \\lambda\\_t\n\n\\end{equation}\nHowever, we do want trucks to appear at their starting factory if we use them. For each truck, the number of legs travelled out of its starting factory is 1 if we use it or 0 otherwise, so equal to a\\_t. Similarly, we want each truck arriving at the warehouse once if we use them.\n\\begin{align}\n\n\\sum\\_{j\\in F}x\\_{t,\\lambda\\_t,j} &amp;= a\\_t, &amp;&amp; \\forall t\\in T \\newline\n\n\\sum\\_{i\\in F}x\\_{t,i,w} &amp;= a\\_t, &amp;&amp; \\forall t\\in T\n\n\\end{align}\nAlso, we don’t want trucks entering their starting factories or leaving the warehouse\n\\begin{align}\n\n\\sum\\_{i\\in F}x\\_{t,i,\\lambda\\_t} &amp;= 0, &amp;&amp; \\forall t\\in T \\newline\n\n\\sum\\_{j\\in F}x\\_{t,w,j} &amp;= 0, &amp;&amp; \\forall t\\in T\n\n\\end{align}\nSo to summarise: If we use a truck (a\\_t=1), then it must appear at factory \\lambda\\_t, not return to \\lambda\\_t, and arrive at and not leave the warehouse w. A truck can only enter a factory if and only if it leaves it, and cannot travel from one factory to itself. A truck can only carry goods down a leg if it is travelling down that leg, up to a maximum of its capacity. All components are picked up by a truck, and since all trucks must arrive at the warehouse, all the components arrive as well. Note that all of these equations are linear expressions. That is, variables are only ever added to each other, never multiplied.\nSolving the problem\nThis set of variables, objective function and constraints completely describes the problem. We can now code the problem up using embedded modelling languages such as JuMP in Julia or PuLP in Python. Then we can use solvers such as Gurobi or CPLEX to find the optimal solutions.\nHowever, at this point we run into a problem. It turns out that this takes extremely long times to solve for anything over about 100 components. That’s because there are two coupled problems that we’re trying to solve. It’s both an assignment problem and a routing problem. We want to decide which components get picked up by which trucks, but also what the optimal route is for the trucks to get to the factory. The way the problem is described, these two elements are directly linked to one another, compounding the computation time needed to solve them. Now we could use more advanced decomposition techniques to simplify things, but instead let’s try and decouple things with a heuristic solution.\nHeuristic Model\nWhat we’re going to do here is sacrifice having the best solution that takes to long to find in favour of getting a good solution that we can find quickly. We decouple the problem by splitting it into two stages: assignment and routing. First we decide which trucks are going to pick up which components (in a suboptimal but still good manner), then we find the fastest routes for each truck individually to pick them all up. This is opposed to the full model where we calculate all these things optimally at the same time, so the routing choice affects the assignment choice and vice versa.\nStep 1: Assignment\nWe need a good way to assign components to trucks. One way we can think about this is to reduce some penalty associated with a truck picking up a component. We want larger penalties if the truck has to travel far out of its way, and smaller if the components are directly on the way to the warehouse.\nThe penalty we use I will refer to as the elliptical detour cost. For a truck starting at factory f, the penalty for the truck picking up a component at factory j is\nd\\_E(f,j) = c\\_{f,j} + c\\_{j,w} - c\\_{f,w}\nThe penalty is the direct path the truck would have to travel to pick up the component and go to the warehouse minus the cost of travelling straight from the factory to the warehouse. Essentially this measures how much extra the truck would have to travel if we only considered thatthat component. If we use distance as our cost function, a constant penalty would describe an ellipse of locations with foci at the factory and the warehouse. A smaller ellipse would correspond to travelling less out of the way on the way to the factory, so that’s what we aim to minimise.\nNow we can fully model this assignment subproblem. The decision variables we will use are\n\n\na\\_t is 1 if truck t is used and 0 otherwise\n\n\ns\\_{t,f} is the number of components that truck t picks up from factory f\n\n\nOur new objective function is to minimise the penalty associated with picking up each component.\n\\min \\sum\\_{t\\in T}\\left(b\\_tc\\_t + \\sum\\_{j\\in F}s\\_{t,j}d\\_E(\\lambda\\_t,j)\\right)\nFor our constraints, we first define the domain of the variables:\n\\begin{align}\n\na\\_t &amp;\\in \\text{{0,1}} &amp;&amp; \\forall t\\in T \\newline\n\ns\\_{t,j} &amp;\\in \\mathbb{N} &amp;&amp; \\forall t\\in T,\\ \\forall j\\in F\n\n\\end{align}\nWe require that all the components are picked up.\n\\begin{equation}\n\n\\sum\\_{t\\in T}s\\_{t,j}=p\\_j,\\qquad \\forall j\\in F\n\n\\end{equation}\nWe only use pick components up with a truck if we use a truck, up to a maximum of its capacity.\n\\begin{equation}\n\n\\sum\\_{j\\in F}s\\_{t,j}\\le q\\_ta\\_t,\\qquad \\forall t\\in T\n\n\\end{equation}\nWe can solve this optimisation problem fairly quickly. Note that we’ve reduced the complexity from O(mn^2) variables and O(mn^2) equations to O(mn) variables and O(mn) equations.\nStep 2: Routing\nNow that we know which truck picks up which components, all we have to do is figure out the best route for each truck to take. Note that this can be worked out independently for each truck. It essentially involves modifying the routing equations in the full mathematical model. This requires m repetitions of a problem with O(n^2) variables and O(n) equations, and is fairly fast to solve.\nAll in all, this heuristic worked fairly well on dummy problems, and allowed us to solve problems with well over 200 factories involved.","date":"2019-11-26T00:00:00.000Z"},"blog/On-Good-Vegan-Recipes":{"slug":"blog/On-Good-Vegan-Recipes","filePath":"blog/On Good Vegan Recipes.md","title":"On Good Vegan Recipes","links":[],"tags":["recipes"],"content":"Most vegan recipes that you find are bad. In two ways: the food they try to make is bad, and the recipe layouts are bad.\nThe food being bad is, I think, a result of the content commodification of places like YouTube and Facebook that are usually linked to vegan websites. In order to pump out content, the current wave of popular vegan recipe-makers often go to publish before they’ve spent enough time on it, or even in some cases publishing while they’re only making it for the first time. This has led to the vast majority of recipes available being terrible, and annoying formats such as “what I eat in a day” style videos. For instance, if you were to search for good Seitan recipes, you would find far more results than you could ever process. Usually, one recipe that the writer will say is great. I have not been able to find a resource that in detail explains what different effects recipes have (e.g. altering water content, oil content, non-flour solids, water temperature, cooking time). Maybe that resource exists, but it is too hard to find under the torrent of bad information.\nWhile this affects the entire online food environment, the vegan world is still plagued by the hippy health aesthetic. It’s impossible to tell for a lot of vegan channels whether they’re doing things because they work or because they fit the aesthetic. It also makes things really annoying to use. Sometimes though, good recipes (e.g. this one seitan recipe) do come out but they’re hard to find under the other trash.\nThe rest of the food world has seen a boom in the way good recipes are produced. Test kitchens are becoming ever more popular and the way things are presented is becoming more refined, focussing more on good explanation (see the rise of YouTube chefs like Binging with Babish and Adam Ragusea). However, there has been no such movement in the vegan world. Fortunately, we can still cash in on these improvements. Serious Eats has in the past produced many vegan recipes on an annual basis which it has made available through its resource the vegan experience. Further, that website and others have a focus on technique that can be applied to other areas. For example, America’s Test Kitchen video series on science-led technique that really improves cooking of mushrooms and cauliflower.\nGenerally, until we see more of a shift to this style that is dedicated to vegan cooking, the best you can really do is follow websites and channels such as these and try to learn what you can that will be useful.\nThe second qualm I have with recipes is their terrible physical layout. As much as I love Serious Eats, their recipes are hard to use, even on a phone (you shouldn’t have to scroll away from your step at any point). Including instructions on the ingredients list just makes things confusing. They do this because in developing recipes, usually all prep is done before the actual cooking. In home kitchens, people don’t usually have a ton of tiny bowls hanging around to hold everything and people are more focussed on saving time. This can be optimised easily while developing a recipe. For instance, compare Serious Eats’ channa masala with mine. I’ll tell you to cut the onions when it’s time to cut the onions.","date":"2019-12-16T00:00:00.000Z"},"blog/The-Metamorphosis":{"slug":"blog/The-Metamorphosis","filePath":"blog/The Metamorphosis.md","title":"The Metamorphosis","links":[],"tags":["book-review"],"content":"Franz Kafka, 1915, an absurdist? modernist? Novella\nI’m sure tons has been written about this bad boy, but I’m going to take a crack at it before reading any other analyses, then see later if I’m stupid.\nThe Metamorphosis is a story about the inherent conflict and dehumanizing nature of a society that forces people to generate value in order to survive. Oh no, I’m a bug and I’m late for work! It’s not the transformation into a bug that makes Gregor inhuman; it is that he cannot work, and how this infiltrates his thoughts and his family.\nGregor has a very pure nature. There is this kind of pure human condition that he seeks to obtain—supporting his family so that his parents can enjoy leisure and sending his sister Grete to the conservatory to learn violin. He doesn’t like his work; he explains the hated nature of being a traveling salesman in very objective terms, as though we’re meant to think that it’s obvious. He has a desire to eventually tell his boss to go shove it. In his ideal world, everyone is happy, healthy, and content, and not forced to work. His thoughts upon his transformation are just about the anxiety of not being able to work and support his family. As his family’s situation gets worse and worse, he continues to be depressed about their financial situation. There is also an aspect where he worries about his own self-actualization, symbolized by the painting he wants to keep in his room, but this is secondary to his concerns about his family.\nThe lack of ability to do work is the main conflict. Gregor is clearly anxious about this, and the opening is an almost unreal realization of the kind of catastrophized thinking someone might have when their family’s well-being depends on their selling their labor. His manager appears when he’s less than an hour late for work (when he’s never been late before in his life) and comically rapidly goes into a barrage about his lack of work, how his boss thinks he’s stolen money, and that his work is even unsatisfactory. This catastrophization goes even further as he can’t defend himself, only squeak. At no point does he really consider the ramifications of becoming a bug; he only tries to save his job. While there is initial disgust at his metamorphosis, this is all done in the context of his losing income, which ties these concepts together. His family starts out tolerating or loving him, especially his sister. But this breaks down due to the family now having to work and rent their flat. The pressures put on their lives drive at the humanity of the family, as they grow to revile him since he makes it hard for them to survive. Due to his presence, they feel forced to keep the large apartment; the work drives them all to exhaustion; the sister cannot pursue her passions; and he makes it impossible for them to rent the spare room in the apartment. This is a threat to their survival, and as they get more desperate, they get more violent, until the sister, who initially loved him in bug form, completely declares him inhuman and says he should be gotten rid of. This is entirely a result of his not being able to generate value. Interestingly, it is the people in the story who don’t derive value from Gregor that are okay with him. The family and his work despise him, but the cleaning lady and the lodgers who encounter him don’t inherently hate him. You can imagine a world where the family’s survival was not predicated on Gregor’s value, in which the family would have been initially afraid but continued to love and accommodate Gregor.\nI think two ideas are being presented here. Due to the way society is set up, it is dehumanizing to labor for someone else, but you are also forced to because it is even more dehumanizing not to work and become invalid.\nEvery character who sells their labor is somewhat despicable. Gregor is servile and hates his job; there is an errand boy described as spineless, and Gregor despises the maid that comes to the house. The Samsas also rent out a room in their house, and this trade of value for money is also dehumanizing as they give up their space, and the lodgers are condescending and entitled. The trade of value for money projects hierarchies that get in the way of the pure world that Gregor wants.\nAt the same time, it is even worse not to earn money because then you are invalid in the society. Gregor is made figuratively inhuman in this sense. I think the obvious parallel can be drawn to becoming disabled and the ramifications of that under a capitalist society where you are forced to sell labor and cannot. But Kafka points towards other examples like being old, fat, clumsy, or even unsuccessful in business. There is a parallel to the furniture that is sentimental to the family but serves no purpose to the lodgers and just ends up gathering dust in the room. You need to continue to be valid and push through, or else your survival is threatened. And in this society, it is so easy for something to change and to become invalid, and this will destroy your humanity. Gregor is made inhuman; the family is made inhuman. They are all invalid.\nI think it’s interesting how things resolve when Gregor dies. There is a moment of sobriety. The family weep and are sad—they have lost their son and brother. They take control of their space and dignity by throwing the lodgers out. As Gregor is dead, there is no conflict between his humanity and his value generation. Humanity is completely restored to him and the family. They continue to be rude to the cleaning lady because she is still having to participate in the conflict. It turns out the only way out is to die.\nThis is all summed up in the last line. The Samsas are now optimistic, as they were when Gregor first got the job and was able to allow the family to thrive. Grete mirrors Gregor at the start, stretching out her young body as Gregor feebly tried to make use of his new insect one. As opposed to the loss of value generation Gregor experiences at the start, here Grete gains value generating ability as she has suddenly transformed in the parents’ eyes to being beautiful and able to marry. Her humanity is now determined by her beauty. The story is doomed to repeat.\n5⁄5","date":"2024-11-14T00:00:00.000Z"},"index":{"slug":"index","filePath":"index.md","title":"Welcome to my website for objective reality","links":["bookshelf","movieshelf","tvshelf","tea-notes","recipes"],"tags":[],"content":"Finally the world has access to my curated tastes\nMedia\n📖 Books  |  🎬 Movies  |  📺 TV\n\nFood and Drink\n🍃 Tea Reviews  |  🍲 Vegan Recipes\n📰 VILF Blog  |  🌱 Vegan Guide to SF  |  🗽 Vegan Guide to NYC\n\nMusic\nChronological Bangers of the 20th century\n\nSongs that I’m about\n\nParty Bangers\n","date":"2025-09-10T18:57:32.643Z"},"tea-notes":{"slug":"tea-notes","filePath":"🍃 Tea Notes.md","title":"🍃 Tea Notes","links":[],"tags":[],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nnamedatere-buy?typecommentsbrew notessourceDry Berry Ruby Oolong2025-03-16YOolongmilky berry-y, yummydaughter’s teaJade Oolong Tea2025-03-16NOolongReally nice sweet smell, slightly sweet potato. But not interesting drinkguy on messengerJade Red Oolong Tea2025-03-16NOolongA little boringguy on messengerAnhua Tianjian 20152025-03-16YHeichaEarthy and brightwhite2teaBlood Moon 20242025-03-16NOolonga little boring, a little fruitywhite2teaCamphornought 2022 Mini2025-03-16YPuer - Ripewoody, smokey, boldwhite2teaMistle 20232025-03-16NBlackreally nice deep and bright, but not too much charactershorter brew timeswhite2teaImperial Dragon Well Tea From Zhejiang2025-03-16YGreenSomewhat acidic and no tannins. Very bright and vegetallook at instructions on websiteyunnan soucing13 Years Aged Da Hong Pao Rock Oolong Tea2025-03-16YOolongearthy, roasty, a little sweetneeds a little more leaf and high tempyunnan sourcingAnxi “Hairy Crab” Mao Xie Fujian Oolong Tea2025-03-16NOolongvery green, not too interestingyunnan sourcingClassic Laoshan Green Tea from Shandong2025-03-16YGreendaily drinker, vegetal and a bit milkyyunnan sourcingCompetition Grade Jin Jun Mei Black Tea2025-03-16YBlackchocolatey smooth - delicious!yunnan sourcingFirst Flush “Mao Feng” Yunnan Green Tea2025-03-16NGreena little boringyunnan sourcingGolden Horse 8685 Ripe Tea in Tangerine2025-03-16NPuer - Ripea little one note, but the tangerine smell is niceyunnan sourcingImperial Grade Silver Needle White Tea of Jinggu2025-03-16YWhiteVery floral and niceyunnan sourcingImperial Mojiang Golden Bud Yunnan Black Tea2025-03-16NBlackChocolate smell - unsure on tasteyunnan sourcingLumberslut 20222025-03-17YPuer - RipeForrest, musty, wood, mushroomwhite2teaPretty Girls 20222025-03-21YPuer - RipeMolassis, barnwhite2teaWaffles 20212025-03-22YPuer - RipeSweet, woody, portywhite2teaGingerbread Man 20222025-03-26NPuer - RipePuery, but a little uninterestingwhite2teaFloral Honey Ruby Oolong2025-03-28YOolongBright, honey, warm milkdaughter’s teaLa Sombra 20232025-03-30NPuer - Rawkinda green, boringwhite2teaLapsun 20232025-04-05NSmokedA little smoky, a little black, nothing crazywhite2teaSun Fu 20182025-04-06NHeichaKinda moldy funky not so pleasant. Wet log in a not so good waywhite2teaRectrix 20222025-04-18NBlacka little sweet and delicious, but not enoughwhite2teaOrganic Nonpareil Ming Qian Dragon Well 20252025-04-19NGreenchestnut, umami, a little sweetteavivreInjured Coast 20222025-05-07NPuer - RawA little roasty. Just tastes like astringent black teawhite2teaReading Room 20232025-05-30YPuer - RipeSweet, syruppy, refined. A bit expensivewhite2teaShotgun Shack 20242025-06-07NPuer - RipeA little boring and just astringentwhite2teaCacao 80 20242025-06-15YPuer - RipeCrazy bitterneeds experimentation. half a coin regular/cold brew. mix with milk/sugar into hot chocolatewhite2teaBellwether 20242025-06-20YPuer - Rawgentle, light, full. kinda lovely. Not remarkable for the price but very nicewhite2teaDitch Pike 20242025-06-22YBlackreally beutiful. sweet, herby, low bitterness, rich. yummaybe get it as daily driverwhite2teaBig O V3 20232025-07-03NPuer - RipeKinda just boringwhite2teaTheophilus 20242025-07-23NPuer - RipeNot super interestingwhite2teaEn Passant 20232025-07-27NPuer - RipeJust bitter, not too interestingwhite2teaMoon Bear 20242025-08-05YPuer - RawSmells like white/green/raw, but a rich molassis caramel peanut brittle mixed with roast grain flavor. A little subtle but nice.white2teaSmokeshou 20212025-08-06YSmokedReally sweet delicious campfire smoke flavor, like smoked salmon, no bitterness or astringency or ashtray.white2teaKarst 20232025-08-07YWhiteFruity, smooth, sweet, floral, delicious. A little on the subtler end but still goodDefinitely could daily drive. Cold brew?white2teaAgeless Phase 20242025-08-08NPuer - RipeBoringwhite2teaGongmei 20192025-08-10NWhiteVery smooth and soothing, fruity notes wihtout being sweet. But not blown awayDualist 20242025-08-15NBlackOk but bit boring black teawhite2teaFruity Citrus Ruby Oolong2025-08-16NOolongSmooth, sweet, fruity, but not as delightful as their other stuff. I might get it if I was doing another order from themdaughter’s teaJin Xuan Milk Oolong2025-08-17NOolongMeant to be a milk oolong but it’s way too subtle. Just an ok oolongteavivreSmoky Charcoal Ruby Oolong2025-08-21YOolongNot super smoky or charcoaly. A little sour and chocolate notes. Maybe refreshing for a cold brew? Xander likes itdaughter’s teaDrills and Jeans 20252025-08-23NWhiteNice, a little too subtle. slightly roasty marshmellow or hot chocolatewhite2teaSnowflake Dancong2025-08-28NOolongKinda boriingwhite2teaJade Yellow Tea2025-08-29NYellowVery midNeed to respect it and do it at 85Cguy on messengerAnhua Tianjian 20212025-09-01NHeichaA little funky and interesting, but didn’t love itwhite2teaNuo Xiang Shu 20032025-09-02YPuer - RipeSuper old and syrupy. Not my faavorite but nice to have around.white2teaSchedule White 20242025-09-05YWhiteSweet, fruity, herby, a lot going on. Great aftertaste. Serious stuff for the $7 pricewhite2teaDian Hong Black Tea - Golden Tip2025-09-09YBlackGreat black tea. herby, good acidity\n\nold.reddit.com/r/tea/comments/1h5t1m7/what_teas_have_you_purchased_in_the_last_week/\nteadb.org/white2tea/\nold.reddit.com/r/puer/comments/1hgaeqw/you_have_120_which_white2tea_shengs_are_you_buying/\nwhite2tea.com/pages/white2tea-tea-club-faq\nold.reddit.com/r/tea/comments/q84dgs/white_tea_recommendations/\nold.reddit.com/r/tea/comments/18ey0dj/recommendations_for_online_vendors_of_chinese_tea/\nold.reddit.com/r/tea/comments/sa9nue/white_teas_wanted/\nRemaining White2tea\nRipe Pu’er (Shou)\n\nAgeless Phase 2024\nCaledonia 2024\nLumber 2023\nLumber 2024\nPredawn Dark 2023 (charcoal-roasted)\nPretty Girls 2021\nRed Loon 2023\nNuo Xiang Shu 2003\nTale Chaser 2022 (drinks like aged shou)\n\nRaw Pu’er (Sheng)\n\nBiscuits 2024\nDualist 2022\nFirebat 2023 (smoked sheng)\nHypnotrain 2022\nOrientalism and the Generated Image 2024\nTihkal 2024\n\nWhite Tea\n(includes charcoal-roasted &amp; moonlight styles)\n\nCharing Cross 2024 (charcoal-roasted)\nDark Peony 2024 (“dark” oxidised white)\nDrills and Jeans 2025 (charcoal-roasted)\nJonia 2025 (charcoal-roasted)\nSilver Fox 2024\nTiltshift 2024 (moonlight / shade-dried)\nGongmei 2019\n\nBlack Tea\n\nScrye 2022\nSunskate 2021 (lightly oxidised, borderline oolong)\n\nHeicha / Dark Tea (non-Pu’er)\n\nAnhua Tianjian 2021\n\nWhite2Tea Purchases\n\nAgeless Phase 2024\nAnhua Tianjian 2015\nAnhua Tianjian 2021\nBellwether 2024\nBig O V3 2023\nBiscuits 2024\nBlood Moon 2024\nCacao 80 2024\nCaledonia 2024\nCamphornought 2022\nCharing Cross 2024\nDark Peony 2024\nDitch Pike 2024\nDrills and Jeans 2025\nDualist 2022\nDualist 2024\nEn Passant 2023\nFirebat 2023\nGingerbread Man 2022\nGongmei 2019\nHypnotrain 2022\nInjured Coast 2022\nJonia 2025\nKarst 2023\nLa Sombra 2023\nLapsun 2023\nLumber 2022\nLumber 2023\nLumber 2024\nMistle 2023\nMoon Bear 2024\nNuo Xiang Shu 2003\nOrientalism and the Generated Image 2024\nPredawn Dark 2023\nPretty Girls 2021\nPretty Girls 2022\nReading Room 2023\nRectrix 2022\nRed Loon 2023\nSchedule White 2024\nScrye 2022\nShotgun Shack 2024\nSilver Fox 2024\nSmokeshou 2021\nSnowflake Dancong (no year)\nSun Fu 2018\nSunskate 2021\nTale Chaser 2022\nTheophilus 2024\nTihkal 2024\nTiltshift 2024\nWaffles 2021\n","date":"2025-09-10T18:57:32.727Z"},"recipes":{"slug":"recipes","filePath":"🍲 Recipes.md","title":"🍲 Recipes","links":["blog/On-Good-Vegan-Recipes","blog/Cooking-Techniques","zSystem/Assets/Besara.pdf","zSystem/Assets/CauliflowerSoup.pdf","zSystem/Assets/ChannaMasala.pdf","zSystem/Assets/Compote.pdf","zSystem/Assets/EzogelinCorbasi.pdf","zSystem/Assets/Goulash.pdf","zSystem/Assets/HunanSesameEggplant.pdf","zSystem/Assets/KimchiJigae.pdf","zSystem/Assets/MapoTofu.pdf","zSystem/Assets/MisoSoup.pdf","zSystem/Assets/MushroomKorma.pdf","zSystem/Assets/MushroomMisoRisotto.pdf","zSystem/Assets/NasuDengaku.pdf","zSystem/Assets/PastaAllaItsi.pdf","zSystem/Assets/PumpkinMasala.pdf","zSystem/Assets/Ragu.pdf","zSystem/Assets/TomatoSoup.pdf"],"tags":["recipes"],"content":"Here are my workshopped vegan recipes.\nQuite annoyingly, most available vegan recipes are bad. Feel free to my rant about it: On Good Vegan Recipes\nHere is a list of useful Cooking Techniques\nTo follow my recipes:\n\nThe ingredients list is a shopping list, ignore it once you’ve started cooking.\nTo improve time efficiency, prep and cooking steps are interspersed in each other. While you’re waiting for mushrooms to cook you should really be doing the next prep step.\nIf some steps are labelled as a ‘group’, it means to combine them in the same vessel and they’ll all be added to the dish together.\nRecipes are usually made for the minimum possible quantity. Scale-up as necessary.\nBuy a bag of MSG and add it to everything, you coward.\n\nPlease contact me for any questions or suggested improvements.\nRecipe List\nBesara (Green Pea Dip)\nCauliflower Soup\nChanna Masala (Chickpea Curry)\nCompote\nEzogelin Çorbasi (Lentil soup)\nGoulash\nHunan Sesame Eggplant\nKimchi Jigae\nMapo Tofu\nMiso Soup\nMushroom Korma\nMushroom Miso Risotto\nNasu Dengaku (Miso glazed eggplant)\nPasta alla Itsi\nPumpkin Masala\nRagù\nTomato Soup","date":"2025-09-10T18:57:32.770Z"},"movieshelf":{"slug":"movieshelf","filePath":"🎬 MovieShelf.md","title":"🎬 MovieShelf","links":[],"tags":[],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPosterTitleDirectorGenre⭐Adaptation.Spike JonzeComedy, Drama⭐The BrutalistBrady CorbetDrama⭐Beau Is AfraidAri AsterComedy, Drama, Horror⭐In BrugesMartin McDonaghComedy, Crime, Drama⭐Bo Burnham: InsideBo BurnhamDocumentary, Comedy, Drama⭐World of Tomorrow Episode Two: The Burden of Other People’s ThoughtsDon HertzfeldtAnimation, Short, Comedy⭐The Pervert’s Guide to IdeologySophie FiennesDocumentary⭐Uncut GemsBenny Safdie, Josh SafdieCrime, Drama, Thriller⭐World of TomorrowDon HertzfeldtAnimation, Short, Comedy⭐The Killing of a Sacred DeerYorgos LanthimosDrama, Horror, Mystery⭐The LobsterYorgos LanthimosDrama, Romance, Sci-Fi⭐A Serious ManEthan Coen, Joel CoenComedy, Drama⭐Everything Is IlluminatedLiev SchreiberComedy, Drama⭐ParasiteBong Joon HoDrama, Thriller⭐Allegro non troppoBruno BozzettoAnimation, Comedy, Fantasy⭐Grave of the FirefliesIsao TakahataAnimation, Drama, War⭐Jacqueline Novak: Get on Your KneesNatasha LyonneDocumentary, Comedy⭐Anatomy of a FallJustine TrietCrime, Drama, Thriller⭐Poor ThingsYorgos LanthimosComedy, Drama, Romance⭐Mary and MaxAdam ElliotAnimation, Comedy, Drama👍Caught by the TidesJia Zhang-keDrama👍TombstoneGeorge P. CosmatosBiography, Drama, History👍The SubstanceCoralie FargeatDrama, Horror, Sci-Fi👍AnoraSean BakerComedy, Drama, Romance👍Baby DriverEdgar WrightAction, Crime, Drama👍Bardo: False Chronicle of a Handful of TruthsAlejandro G. IñárrituComedy, Drama👍The FarewellLulu WangComedy, Drama👍Princess MononokeHayao MiyazakiAnimation, Adventure, Fantasy👍Birdman or (The Unexpected Virtue of Ignorance)Alejandro G. IñárrituComedy, Drama👍Everything Everywhere All at OnceDaniel Kwan, Daniel ScheinertAction, Adventure, Comedy👍The IrishmanMartin ScorseseBiography, Crime, Drama👍Léon: The ProfessionalLuc BessonAction, Crime, Drama👍WhiplashDamien ChazelleDrama, Music👍The Death of StalinArmando IannucciComedy, Drama, History👍The Grand Budapest HotelWes AndersonAdventure, Comedy, Crime👍Four LionsChristopher MorrisComedy, Crime, Drama👍Vampire’s KissRobert BiermanComedy, Crime, Fantasy👍What We Do in the ShadowsJemaine Clement, Taika WaititiComedy, Horror👍Isle of DogsWes AndersonAnimation, Adventure, Comedy👍The Trial of the Chicago 7Aaron SorkinDrama, History, Thriller👍The Boy and the HeronHayao MiyazakiAnimation, Adventure, Drama👍The Iron GiantBrad BirdAnimation, Action, Adventure👍Master and Commander: The Far Side of the WorldPeter WeirAction, Adventure, Drama🤷Citizen KaneOrson WellesDrama, Mystery🤷Swiss Army ManDaniel Kwan, Daniel ScheinertComedy, Drama, Fantasy🤷Airplane!Jim Abrahams, David Zucker, Jerry ZuckerComedy🤷AnnihilationAlex GarlandAdventure, Drama, Horror🤷Ex MachinaAlex GarlandDrama, Sci-Fi, Thriller🤷HerSpike JonzeDrama, Romance, Sci-Fi🤷The Banshees of InisherinMartin McDonaghComedy, Drama🤷Three Billboards Outside Ebbing, MissouriMartin McDonaghComedy, Crime, Drama🤷The Big ShortAdam McKayBiography, Comedy, Drama🤷The MasterPaul Thomas AndersonDrama, History🤷The Wolf of Wall StreetMartin ScorseseBiography, Comedy, Crime🤷Memoir of a SnailAdam ElliotAnimation, Drama🤷The CastleRob SitchComedy, Drama🤷About TimeRichard CurtisComedy, Drama, Fantasy🤷Dream ScenarioKristoffer BorgliComedy, Drama, Fantasy🤷Kinds of KindnessYorgos LanthimosComedy, Drama, Horror🤷The Rescuers Down UnderHendel Butoy, Mike GabrielAnimation, Adventure, Comedy👎KimiSteven SoderberghCrime, Drama, Mystery👎Juror #2Clint EastwoodCrime, Drama, Mystery👎ConclaveEdward BergerDrama, Thriller👎A Different ManAaron SchimbergComedy, Drama, Thriller👎ProblemistaJulio TorresComedy👎A Real PainJesse EisenbergComedy, Drama👎Civil WarAlex GarlandAction, Adventure, Thriller👎Next Goal WinsTaika WaititiComedy, Drama, SportAmerican FictionCord JeffersonComedy, DramaDownfallOliver HirschbiegelBiography, Drama, HistoryHeathersMichael LehmannComedy, CrimeBabyteethShannon MurphyComedy, Drama, MusicCloud AtlasTom Tykwer, Lana Wachowski, Lilly WachowskiDrama, Mystery, Sci-FiForce MajeureRuben ÖstlundComedy, DramaChicken RunPeter Lord, Nick ParkAnimation, Adventure, ComedyChicken Run: Dawn of the NuggetSam Fell, Jeff NewittAnimation, Adventure, ComedyUp in the AirJason ReitmanComedy, Drama, RomanceHolesAndrew DavisAdventure, Comedy, DramaStop Making SenseJonathan DemmeDocumentary, MusicAntzEric Darnell, Tim Johnson, Lawrence GutermanAnimation, Adventure, ComedyThe Worst Person in the WorldJoachim TrierComedy, Drama, RomanceL’ArgentRobert BressonCrime, DramaTangerinesZaza UrushadzeDrama, WarHow to Blow Up a PipelineDaniel GoldhaberAction, Crime, DramaThe Devil, ProbablyRobert BressonDramaThe Garden of the Finzi-ContinisVittorio De SicaDrama, History, WarHe Died with a Felafel in His HandRichard LowensteinComedy, RomanceHidalgoJoe JohnstonAction, Adventure, BiographySlaughterhouse-FiveGeorge Roy HillComedy, Drama, Sci-FiGattacaAndrew NiccolDrama, Sci-Fi, ThrillerNever Let Me GoMark RomanekDrama, RomanceDrive My CarRyûsuke HamaguchiDramaBrazilTerry GilliamDrama, Sci-Fi, ThrillerHouseboundGerard JohnstoneComedy, Horror, MysteryThe Baader Meinhof ComplexUli EdelAction, Biography, CrimeThe Raspberry ReichBruce La BruceComedy, Drama, RomancePride &amp; PrejudiceJoe WrightDrama, RomanceChildren of MenAlfonso CuarónDrama, Sci-Fi, ThrillerPhantom ThreadPaul Thomas AndersonDrama, RomanceMichael ClaytonTony GilroyCrime, Drama, MysteryIn the Mood for LoveWong Kar-WaiDrama, RomanceThere Will Be BloodPaul Thomas AndersonDramaChildren of GodKareem MortimerDramaThe Zone of InterestJonathan GlazerDrama, History, WarA SeparationAsghar FarhadiDramaBoyhoodRichard LinklaterDramaY tu mamá tambiénAlfonso CuarónDramaA ProphetJacques AudiardCrime, DramaThe Lives of OthersFlorian Henckel von DonnersmarckDrama, Mystery, ThrillerYi YiEdward YangDrama, RomanceUnder the SkinJonathan GlazerDrama, Horror, MysteryCarolTodd HaynesDrama, RomanceLet the Right One InTomas AlfredsonDrama, Fantasy, HorrorThe Florida ProjectSean BakerDramaFrances HaNoah BaumbachComedy, Drama, RomanceO Brother, Where Art Thou?Joel Coen, Ethan CoenAdventure, Comedy, CrimeIndus BluesJawad SharifDocumentary, MusicalHappinessTodd SolondzComedy, DramaWorld of Tomorrow Episode Three: The Absent Destinations of David PrimeDon HertzfeldtAnimation, Short, Comedy","date":"2025-09-10T18:57:32.837Z"},"bookshelf":{"slug":"bookshelf","filePath":"📖 BookShelf.md","title":"📖 BookShelf","links":[],"tags":[],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCoverTitleAuthorCategory⭐MetamorphosisFranz KafkaFiction⭐Slaughterhouse-fiveKurt VonnegutCensorship⭐The Deficit MythStephanie KeltonBusiness &amp; Economics⭐Bullshit JobsDavid GraeberSocial Science👍The People’s Republic of WalmartLeigh Phillips, Michal RozworskiPolitical Science👍If We BurnVincent BevinsHistory👍Manufacturing ConsentEdward S. Herman, Noam ChomskySocial Science👍Thinking in SystemsDonella MeadowsBusiness &amp; Economics👍Developer HegemonyErik DietrichBusiness &amp; Economics👍Drive Your Plow Over the Bones of the DeadOlga TokarczukFiction👍A Psalm for the Wild-BuiltBecky ChambersFiction🤷The Rest Is NoiseAlex RossMusic🤷The Iliad of HomerHomer[]👎Against EmpathyPaul BloomPsychologyBad News from VenezuelaAlan MacleodSocial ScienceThe Dawn of EverythingDavid Graeber, David WengrowSocial ScienceDavid Foster Wallace’s Infinite JestStephen J. BurnLiterary CriticismThe Emperor’s New DrugsIrving KirschPsychologyThe Myth of Mental IllnessThomas S. SzaszPsychologyUntangling SelfAndrew OlendzkiReligionGod &amp; Golem, Inc.Norbert WienerPhilosophyPachinko (National Book Award Finalist)Min Jin LeeFictionThe Value of EverythingMariana MazzucatoBusiness &amp; EconomicsTomorrow, and Tomorrow, and TomorrowGabrielle ZevinFictionThe Ecology of FreedomMurray BookchinHistoryHopscotchJulio CortázarFictionThe FountainheadAyn RandFictionThe Master &amp; MargaritaMikhail BulgakovFictionThe Wizard and the ProphetCharles C. MannScienceAbolish RentTracy Rosenthal, Leonardo VilchisSocial ScienceCan’t Pay, Won’t PayCollective DebtSocial ScienceCapitalist RealismMark FisherPolitical ScienceNapoleon’s ButtonsPenny Le Couteur, Jay BurresonScienceEucalyptusMurray BailFictionGoatManThomas ThwaitesBiography &amp; AutobiographyThe SonglinesBruce ChatwinTravelWhite NoiseDon DeLilloFictionOn Murder Considered as one of the Fine ArtsThomas de QuinceyFictionRamping Your BrandJames F. RichardsonBusiness &amp; EconomicsUnder a White SkyElizabeth KolbertSciencePedro PáramoJuan Rulfo, Josephine Sacabo, Margaret Sayers PedenFictionThe Plain in FlamesJuan RulfoFictionConversation in the CathedralMario Vargas LlosaFictionHow the War Was WonPhillips Payson O’BrienHistoryEconomics Without IllusionsJoseph HeathBusiness &amp; EconomicsThank You for Arguing, Fourth Edition (Revised and Updated)Jay HeinrichsLanguage Arts &amp; DisciplinesUnderstanding MediaMarshall McLuhan[]Why We’re Getting PoorerCahal MoranBusiness &amp; EconomicsHealth CommunismBeatrice Adler-Bolton, Artie VierkantPolitical ScienceAgainst PlatformsMike PepiSocial ScienceThe Limits of GrowthD. H. Meadows[]Neoliberalism’s DemonsAdam KotskoPolitical ScienceThe CrowdGustave Le BonFictionThe Jakarta MethodVincent BevinsPolitical ScienceLiberalismDomenico LosurdoPolitical ScienceWho Are We Now?Blaise Aguera y ArcasComputersMeat PlanetBenjamin Aldes WurgaftSocial ScienceThe Chapo Guide to RevolutionChapo Trap House, Felix Biederman, Matt Christman, Brendan James, Will Menaker, Virgil TexasHumorSelling Social JusticeJennifer C. PanSocial ScienceAgainst the WebMichael BrooksPhilosophyChangeDamon CentolaSocial ScienceHow Behavior SpreadsDamon CentolaSocial ScienceHere I AmJonathan Safran FoerFictionSimulacra and SimulationJean BaudrillardArtAs a Driven LeafMilton SteinbergFiction","date":"2025-09-10T18:57:32.910Z"},"tvshelf":{"slug":"tvshelf","filePath":"📺  TVShelf.md","title":"📺  TVShelf","links":[],"tags":[],"content":"\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRatingPosterTitleWriter⭐Avatar: The Last AirbenderMichael Dante DiMartino, Bryan Konietzko⭐BoJack HorsemanRaphael Bob-Waksberg⭐Limmy’s Show!Brian Limond⭐Indian MatchmakingN/A⭐AtlantaDonald Glover⭐Arrested DevelopmentMitchell Hurwitz⭐You Can’t Ask ThatN/A⭐Love on the SpectrumN/A⭐How to with John WilsonN/A⭐Nathan for YouNathan Fielder, Michael Koman⭐SuccessionJesse Armstrong⭐WatchmenN/A⭐UnorthodoxAnna Winger⭐Better Call SaulVince Gilligan, Peter Gould⭐FleabagPhoebe Waller-Bridge⭐LouieLouis C.K.⭐Los EspookysFred Armisen, Ana Fabrega, Julio Torres⭐Peep ShowJesse Armstrong, Sam Bain, Andrew O’Connor👍America’s Next Top ModelKen Mok, Tyra Banks, Kenya Barris👍Aunty Donna’s Big Ol’ House of FunAunty Donna👍EasyJoe Swanberg👍Russian DollLeslye Headland, Natasha Lyonne, Amy Poehler👍The Great British Baking ShowN/A👍MisfitsHoward Overman👍Master of NoneAziz Ansari, Alan Yang👍I Think You Should Leave with Tim RobinsonZach Kanin, Tim Robinson👍RakePeter Duncan, Richard Roxburgh, Charles Waterstreet👍MaidMolly Smith Metzler👍Carol &amp; The End of the WorldDan Guterman👍On Becoming a God in Central FloridaRobert Funke, Matt Lutsky👍Why Women KillMarc Cherry👍Flight of the ConchordsJames Bobin, Jemaine Clement, Bret McKenzie👍Please Like MeN/A👍Breaking BadVince Gilligan👍Killing EvePhoebe Waller-Bridge👍FargoNoah Hawley👍Curb Your EnthusiasmLarry David🤷Alice in BorderlandHaro Aso🤷Big MouthJennifer Flackett, Andrew Goldberg, Nick Kroll🤷BridgertonChris Van Dusen🤷DetroitersZach Kanin, Joe Kelly, Sam Richardson🤷LovesickTom Edge🤷SeinfeldLarry David, Jerry Seinfeld🤷Stranger ThingsMatt Duffer, Ross Duffer🤷The Queen’s GambitScott Frank, Allan Scott🤷Your HonorPeter Moffat🤷UtopiaSanto Cilauro, Tom Gleisner, Rob Sitch🤷Love, Death &amp; RobotsTim Miller🤷After LifeRicky Gervais🤷Sex EducationLaurie Nunn🤷The Eric Andre ShowEric André🤷Black MirrorCharlie Brooker👎FBoy IslandElan Gale👎Jewish MatchmakingN/A👎KaosCharlie Covell👎The Umbrella AcademySteve Blackman, Jeremy Slater👎WednesdayAlfred Gough, Miles Millar👎YouGreg Berlanti, Sera Gamble👎3 Body ProblemDavid Benioff, D.B. Weiss, Alexander Woo👎Kim’s ConvenienceN/A👎DisenchantmentMatt Groening, Josh Weinstein👎Sex and the CityDarren StarMr. Show with Bob and DavidDavid Cross, Bob OdenkirkThe Dana Carvey ShowDana Carvey, Robert SmigelThe CurseNathan Fielder, Benny SafdieUnder the Banner of HeavenDustin Lance BlackCouples TherapyN/A","date":"2025-09-10T18:57:32.943Z"}}